src/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/AccountingRegisters/Хозрасчетный/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Устарела.
Функция ЗаполнитьДвижениеРасчетыСПерсоналом(Знач движение, Знач дата, Знач структураНачисления, Знач содержание) Экспорт
    движение.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
    движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
    движение.Период = дата;
    движение.Сумма = структураНачисления.Сумма;
    движение.Содержание = содержание;
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(движение.СчетДт,
        движение.СубконтоДт, структураНачисления.СтатьяЗатрат);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(движение.СчетКт,
        движение.СубконтоКт, структураНачисления.Сотрудник);

    Возврат движение;
КонецФункции

// Добавляет новую запись в регистр бухгалтерии `Хозрасчетный` для учета поступления услуг
// Параметры:
//  дата - Дата - Дата записи
//  наборЗаписей - РегистрБухгалтерииНаборЗаписей.Хозрасчетный - Набор записей
//  строкаУслуг - Структура, ФиксированнаяСтруктура
//      * Сумма - Число
//      * СчетБухгалтерскогоУчета - ПланСчетовСсылка.Хозрасчетный
//      * СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат - отражается в субконто дебета
//  поставщик - СправочникСсылка.Контрагенты - отражается в субконто кредита
// Возвращаемое значение:
//  - РегистрБухгалтерииЗапись - Заполненная запись
Функция ДобавитьЗаписьПоступлениеУслуг(Знач дата, Знач наборЗаписей, Знач строкаУслуг, Знач поставщик) Экспорт
    записьБУ = наборЗаписей.Добавить();
    записьБУ.СчетДт = строкаУслуг.СчетБухгалтерскогоУчета;
    записьБУ.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
    записьБУ.Период = дата;
    записьБУ.Сумма = строкаУслуг.Сумма;
    записьБУ.Содержание = ПолучитьСодержаниеДляПоступленияУслуг();
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(записьБУ.СчетДт, записьБУ.СубконтоДт, строкаУслуг.СтатьяЗатрат);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(записьБУ.СчетКт, записьБУ.СубконтоКт, поставщик);

    Возврат записьБУ;
КонецФункции

// Добавляет новую запись в регистр бухгалтерии `Хозрасчетный` для учета поступления товаров и материалов
// Параметры:
//  дата - Дата - Дата записи
//  наборЗаписей - РегистрБухгалтерииНаборЗаписей.Хозрасчетный - Набор записей
//  строкаТоваров - Структура, ФиксированнаяСтруктура, СтрокаТаблицыЗначений
//      * Сумма - Число
//      * СчетБухгалтерскогоУчета - ПланСчетовСсылка.Хозрасчетный
//      * Номенклатура - СправочникСсылка.Номенклатура - отражается в субконто дебета
//  поставщик - СправочникСсылка.Контрагенты - отражается в субконто кредита
// Возвращаемое значение:
//  - РегистрБухгалтерииЗапись - Заполненная запись
Функция ДобавитьЗаписьПоступлениеТМЦ(Знач дата, Знач наборЗаписей, Знач строкаТоваров, Знач поставщик) Экспорт
    записьБУ = наборЗаписей.Добавить();
    записьБУ.СчетДт = строкаТоваров.СчетБухгалтерскогоУчета;
    записьБУ.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
    записьБУ.Период = дата;
    записьБУ.Сумма = строкаТоваров.Сумма;
    записьБУ.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(записьБУ.СчетДт, записьБУ.СубконтоДт, строкаТоваров.Номенклатура);
    БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(записьБУ.СчетКт, записьБУ.СубконтоКт, поставщик);

    Возврат записьБУ;
КонецФункции

// Возвращаемое значение:
//  - Строка - Содержание по умолчанию для поступления услуг
Функция ПолучитьСодержаниеДляПоступленияУслуг() Экспорт
    Возврат "Отражено поступление услуг от поставщика";
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
